
CLK_PULSE_DONE
SEND_CMD0
command:   0100000000000000000000000000000000000000 10010101
response:  
SEND_CMD8
command:   0100100000000000000000000000000110101010 10000111
response:  000010000000000000000000000000011010101000010011
SEND_QUERY_CMD55
command:   0111011100000000000000000000000000000000 01100101
response:  001101110000000000000000000000010010000010000011
SEND_QUERY_CMD41
command:   0110100101000000000000000000000000000000 01110111
response:  00111111 01000000111111111000000000000000 11111111
SEND_INIT_CMD55
command:   0111011100000000000000000000000000000000 01100101
response:  001101110000000000000000000000010010000010000011
SEND_INIT_CMD41
command:   0110100101000000111111111000000000000000 00010111
response:  001111110100000011111111100000000000000011111111
SEND_QUERY2_CMD55
command:   0111011100000000000000000000000000000000 01100101
response:  001101110000000000000000000000010010000010000011
SEND_QUERY2_CMD41
command:   0110100101000000000000000000000000000000 01110111
response:  001111111100000011111111100000000000000011111111
CHECK_INITDONE_CMD41
CHK_ACMD41_RESPONSE: 11

##################################################################

CMD2
Enter command : R2=0100001000000000000000000000000000000000
length to send (bits):  48
encoded:   01000010000000000000000000000000000000000100110
command:   010000100000000000000000000000000000000001001101
response:  001111110000001101010011010001000101001101000011
           001111110000001101010011010001000101001101000011
	   
CMD3 (twice)
Enter command to send (do not include CRC or stop bit)
Enter command : R1=0100001100000000000000000000000000000000
length to send (bits):  48
encoded:   01000011000000000000000000000000000000000010000
command:   010000110000000000000000000000000000000000100001
response:  000000111010101010101011000001110000000011000111

00000011 1010101010101011 000 0011 10000 0000 11000111
             RCA
00000011 1010101010101011 000 0011 10000 0000 11000111

CMD7
01000111 00000000000000000000000000000000
         1010101010101010
	 1010101010101011

R1=0100011110101010101010100000000000000000
R1=0100011110101010101011010000000000000000 (worked) RCA is changing???
R1=0100011110101010101010110000000000000000 (RCA is changing)
	
Enter command : 0100011110101010101010100000000000000000
length to send (bits):  48
encoded:   01000111101010101010101000000000000000001100110
command:   010001111010101010101010000000000000000011001101
response:  000001110000000000000000000001110000000001110101

00000111 0000000000000000 000 0011 100000000 01110101
00000111 0000000000000000 000 0011 100000000 01110101
00000111 0000000000000000 000 0011 100000000 01110101
                              STBY

CMD13 - CHECK CARD STATUS
R1=010011011010101010101011
R1=0100110110101010101011010000000000000000 (worked)
R1=0100110110101010101010110000000000000000

                                 TRAN
00001101 0000 0000 0000 0000 000 0100 1 0000 0000 00111111

##################################################################

SEND_CMD55
R1=0111011100000000000000000000000000000000

# SET BUS WIDTH
ACMD6
R1=0100011000000000000000000000000000000010
Enter command : 0100011000000000000000000000000000000010
length to send (bits):  48
encoded:   01000110000000000000000000000000000000101100101
command:   010001100000000000000000000000000000001011001011
response:  00000110 00000000000000000000 1001 0000 0000 11011101

           00000110 00000000000000000000 1001 0000 0000 11011101



CMD13 - CHECK CARD STATUS
R1=010011011010101010101011
R1=0100110110101010101011010000000000000000 (worked)
R1=0100110110101010101010110000000000000000

                                 DATA
00001101 0000 0000 0000 0000 000 0101 1 0000 0000 00010011

####################################################################

(here)

CMD12 - STOP TRAN - OPERATION COMPLETE
R1=0000110000000000000000000000000000000000 (no resp worked)

CMD13 - CHECK CARD STATUS
R1=0100110110101010101010110000000000000000

00001101 0000 0000 0000 0000 000 0100 1 0000 0000 00010011

CMD7
01000111 00000000000000000000000000000000
         1010101010101010
	 1010101010101011

R1=0100011110101010101010110000000000000000 (RCA is changing)
